In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
score_list = np.random.randint(25, 100, size=20)

In [5]:
score_list

array([59, 65, 74, 48, 83, 91, 82, 92, 28, 80, 70, 72, 42, 47, 41, 43, 37,
       48, 78, 48])

In [6]:
# 数据分组  bins取值范围
bins = [0, 59, 70, 80, 100]

In [7]:
score_cut = pd.cut(score_list, bins)

In [8]:
# 返回对应数据的个数
pd.value_counts(score_cut)

(0, 59]      10
(80, 100]     4
(70, 80]      4
(59, 70]      2
dtype: int64

In [9]:
# 生成学生对应的成绩
df = DataFrame()

df['score'] = score_list

In [10]:
# 随机生成长度为3的字符串
df['student'] = [pd.util.testing.rands(3) for i in range(20)]

In [11]:
df

    score student
0      59     MBs
1      65     JDs
2      74     4IV
3      48     55c
4      83     F0n
5      91     yjk
6      82     igH
7      92     kfY
8      28     P9i
9      80     hwg
10     70     tbx
11     72     HuL
12     42     I2k
13     47     OPm
14     41     Fkj
15     43     3zR
16     37     hmy
17     48     Ncb
18     78     TTL
19     48     LCt

In [16]:
# 将产生的分组加入df中  labels 对应bins中的分数
df['categories'] = pd.cut(df['score'], bins, labels=['low', 'ok', 'good', 'great'])

In [17]:
df

    score student categories
0      59     MBs        low
1      65     JDs         ok
2      74     4IV       good
3      48     55c        low
4      83     F0n      great
5      91     yjk      great
6      82     igH      great
7      92     kfY      great
8      28     P9i        low
9      80     hwg       good
10     70     tbx         ok
11     72     HuL       good
12     42     I2k        low
13     47     OPm        low
14     41     Fkj        low
15     43     3zR        low
16     37     hmy        low
17     48     Ncb        low
18     78     TTL       good
19     48     LCt        low

## 数据分组技术groupby

In [18]:
!ls ./data/

AMZN.csv             demo_duplicate.csv   top5.csv
BABA.csv             demo_duplicate_1.csv train.csv
Pokemon.csv          iris.csv             usa_flights.csv
apply_demo.csv       movie_metadata.csv
city_weather.csv     sales-funnel.xlsx

In [19]:
df = pd.read_csv('./data/city_weather.csv')

In [20]:
df

          date city  temperature  wind
0   03/01/2016   BJ            8     5
1   17/01/2016   BJ           12     2
2   31/01/2016   BJ           19     2
3   14/02/2016   BJ           -3     3
4   28/02/2016   BJ           19     2
5   13/03/2016   BJ            5     3
6   27/03/2016   SH           -4     4
7   10/04/2016   SH           19     3
8   24/04/2016   SH           20     3
9   08/05/2016   SH           17     3
10  22/05/2016   SH            4     2
11  05/06/2016   SH          -10     4
12  19/06/2016   SH            0     5
13  03/07/2016   SH           -9     5
14  17/07/2016   GZ           10     2
15  31/07/2016   GZ           -1     5
16  14/08/2016   GZ            1     5
17  28/08/2016   GZ           25     4
18  11/09/2016   SZ           20     1
19  25/09/2016   SZ          -10     4

In [21]:
# 根据城市进行划分
g = df.groupby(df['city'])

In [22]:
g

In [24]:
g.groups

{'BJ': Int64Index([0, 1, 2, 3, 4, 5], dtype='int64'),
 'GZ': Int64Index([14, 15, 16, 17], dtype='int64'),
 'SH': Int64Index([6, 7, 8, 9, 10, 11, 12, 13], dtype='int64'),
 'SZ': Int64Index([18, 19], dtype='int64')}

In [27]:
df_bj = g.get_group('BJ')

In [28]:
df_bj.mean()

temperature    10.000000
wind            2.833333
dtype: float64

In [29]:
# 对城市的每个分组求平均值
g.mean()

      temperature      wind
city
BJ         10.000  2.833333
GZ          8.750  4.000000
SH          4.625  3.625000
SZ          5.000  2.500000

In [30]:
g.max()

            date  temperature  wind
city
BJ    31/01/2016           19     5
GZ    31/07/2016           25     5
SH    27/03/2016           20     5
SZ    25/09/2016           20     4

In [31]:
# 将g变成list

In [32]:
list(g)

[('BJ',          date city  temperature  wind
  0  03/01/2016   BJ            8     5
  1  17/01/2016   BJ           12     2
  2  31/01/2016   BJ           19     2
  3  14/02/2016   BJ           -3     3
  4  28/02/2016   BJ           19     2
  5  13/03/2016   BJ            5     3),
 ('GZ',           date city  temperature  wind
  14  17/07/2016   GZ           10     2
  15  31/07/2016   GZ           -1     5
  16  14/08/2016   GZ            1     5
  17  28/08/2016   GZ           25     4),
 ('SH',           date city  temperature  wind
  6   27/03/2016   SH           -4     4
  7   10/04/2016   SH           19     3
  8   24/04/2016   SH           20     3
  9   08/05/2016   SH           17     3
  10  22/05/2016   SH            4     2
  11  05/06/2016   SH          -10     4
  12  19/06/2016   SH            0     5
  13  03/07/2016   SH           -9     5),
 ('SZ',           date city  temperature  wind
  18  11/09/2016   SZ           20     1
  19  25/09/2016   SZ          -10     4)]

In [34]:
dict(list(g))['BJ']

         date city  temperature  wind
0  03/01/2016   BJ            8     5
1  17/01/2016   BJ           12     2
2  31/01/2016   BJ           19     2
3  14/02/2016   BJ           -3     3
4  28/02/2016   BJ           19     2
5  13/03/2016   BJ            5     3

In [37]:
list(g)
# 遍历g
for name, group_df in g:
    print(name)
    print(group_df)

BJ
         date city  temperature  wind
0  03/01/2016   BJ            8     5
1  17/01/2016   BJ           12     2
2  31/01/2016   BJ           19     2
3  14/02/2016   BJ           -3     3
4  28/02/2016   BJ           19     2
5  13/03/2016   BJ            5     3
GZ
          date city  temperature  wind
14  17/07/2016   GZ           10     2
15  31/07/2016   GZ           -1     5
16  14/08/2016   GZ            1     5
17  28/08/2016   GZ           25     4
SH
          date city  temperature  wind
6   27/03/2016   SH           -4     4
7   10/04/2016   SH           19     3
8   24/04/2016   SH           20     3
9   08/05/2016   SH           17     3
10  22/05/2016   SH            4     2
11  05/06/2016   SH          -10     4
12  19/06/2016   SH            0     5
13  03/07/2016   SH           -9     5
SZ
          date city  temperature  wind
18  11/09/2016   SZ           20     1
19  25/09/2016   SZ          -10     4